Revit 2027 API
BuiltInFailures.DimensionFailures.WrongConstraintInJoistSystemSketch Property
 Structural Beam System sketch can't be constrained to its beam.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongConstraintInJoistSystemSketch { get; }
Public Shared ReadOnly Property WrongConstraintInJoistSystemSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongConstraintInJoistSystemSketch {
	FailureDefinitionId^ get ();
}
static member WrongConstraintInJoistSystemSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace